- Ran the files on our staging account on my local machine
- Ran TF Apply (Github Workflow Actions) on our production account. Logs below (added staging.* domains and renamed the staging app)
```
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 4.0"...
- Installing hashicorp/aws v4.56.0...
- Installed hashicorp/aws v4.56.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ca-central-1:***:certificate/9f0ba8e3-50a1-406f-9511-ce1497e43ca1]
aws_ecr_repository.learning_resources: Refreshing state... [id=learning-resources/learning-frontend]
aws_amplify_app.learning_resources: Refreshing state... [id=d3ezatomadqu9b]
aws_route53_zone.en_learning_resources: Refreshing state... [id=Z02780861HBX6V12B05P]
aws_route53_zone.fr_learning_resources: Refreshing state... [id=Z01151971CR34Z91J6W5B]
aws_acm_certificate.fr[0]: Refreshing state... [id=arn:aws:acm:ca-central-1:***:certificate/f869975f-21bd-4104-960a-a0fdd0ca1f8e]
data.aws_iam_policy_document.service_principal: Reading...
data.aws_iam_policy_document.service_principal: Read complete after 0s [id=3693445097]
aws_iam_role.app: Refreshing state... [id=learning-resources-app]
aws_amplify_branch.main: Refreshing state... [id=d3ezatomadqu9b/main]
aws_amplify_domain_association.learning_resources_staging_en: Refreshing state... [id=d3ezatomadqu9b/staging.***]
aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole: Refreshing state... [id=learning-resources-app-20221031190251985800000003]
aws_amplify_domain_association.learning_resources_fr: Refreshing state... [id=d3ezatomadqu9b/***]
aws_amplify_domain_association.learning_resources_en: Refreshing state... [id=d3ezatomadqu9b/***]
aws_route53_record.validation_fr["*.***"]: Refreshing state... [id=Z01151971CR34Z91J6W5B__0d8fef82db47fa56993df92a439fee03.***._CNAME]
aws_route53_record.validation_fr["***"]: Refreshing state... [id=Z01151971CR34Z91J6W5B__0d8fef82db47fa56993df92a439fee03.***._CNAME]
aws_route53_record.validation_main["***"]: Refreshing state... [id=Z02780861HBX6V12B05P__d4d565c5582fb74e2e36118594986619.***._CNAME]
aws_route53_record.validation_main["*.***"]: Refreshing state... [id=Z02780861HBX6V12B05P__d4d565c5582fb74e2e36118594986619.***._CNAME]
aws_acm_certificate_validation.fr[0]: Refreshing state... [id=2022-10-31 19:03:08.[26](https://github.com/cds-snc/resources-terraform/actions/runs/4288636884/jobs/7472743796#step:6:27)4 +0000 UTC]
aws_acm_certificate_validation.main: Refreshing state... [id=2022-10-[31](https://github.com/cds-snc/resources-terraform/actions/runs/4288636884/jobs/7472743796#step:6:32) 19:03:09.906 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_amplify_branch.lr_staging will be created
  + resource "aws_amplify_branch" "lr_staging" {
      + app_id                        = "d3ezatomadqu9b"
      + arn                           = (known after apply)
      + associated_resources          = (known after apply)
      + branch_name                   = "staging"
      + custom_domains                = (known after apply)
      + destination_branch            = (known after apply)
      + display_name                  = "staging"
      + enable_auto_build             = true
      + enable_pull_request_preview   = true
      + environment_variables         = {
          + "DOMAIN_EN" = "staging.***"
          + "DOMAIN_FR" = "staging.***"
          + "ENV"       = "prod"
        }
      + framework                     = "NuxtJS"
      + id                            = (known after apply)
      + pull_request_environment_name = "PULL_REQUEST"
      + source_branch                 = (known after apply)
      + stage                         = "BETA"
      + tags_all                      = (known after apply)
    }

  # aws_amplify_branch.main will be updated in-place
  ~ resource "aws_amplify_branch" "main" {
        id                            = "d3ezatomadqu9b/main"
      - pull_request_environment_name = "RELEASE" -> null
        tags                          = {}
        # (16 unchanged attributes hidden)
    }

  # aws_amplify_domain_association.learning_resources_staging_en will be updated in-place
  ~ resource "aws_amplify_domain_association" "learning_resources_staging_en" {
        id                                  = "d3ezatomadqu9b/staging.***"
        # (5 unchanged attributes hidden)

      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_amplify_domain_association.learning_resources_staging_fr will be created
  + resource "aws_amplify_domain_association" "learning_resources_staging_fr" {
      + app_id                              = "d3ezatomadqu9b"
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "staging.***"
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
aws_amplify_branch.lr_staging: Creating...
aws_amplify_branch.main: Modifying... [id=d3ezatomadqu9b/main]
aws_amplify_branch.main: Modifications complete after 0s [id=d3ezatomadqu9b/main]
aws_amplify_branch.lr_staging: Creation complete after 0s [id=d3ezatomadqu9b/staging]
aws_amplify_domain_association.learning_resources_staging_fr: Creating...
aws_amplify_domain_association.learning_resources_staging_en: Modifying... [id=d3ezatomadqu9b/staging.***]
aws_amplify_domain_association.learning_resources_staging_fr: Creation complete after 0s [id=d3ezatomadqu9b/staging.***]
aws_amplify_domain_association.learning_resources_staging_en: Modifications complete after 2s [id=d3ezatomadqu9b/staging.***]

Apply complete! Resources: 2 added, 2 changed, 0 destroyed.
```